tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1787_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F1787_H_
#define _PIC16F1787_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define RA6                           42
#define RA7                           43
#define PORTB                         44
#define RB0                           45
#define RB1                           46
#define RB2                           47
#define RB3                           48
#define RB4                           49
#define RB5                           50
#define RB6                           51
#define RB7                           52
#define RC0                           53
#define PORTC                         54
#define RC1                           55
#define RC2                           56
#define RC3                           57
#define RC4                           58
#define RC5                           59
#define RC6                           60
#define RC7                           61
#define RD0                           62
#define PORTD                         63
#define RD1                           64
#define RD2                           65
#define RD3                           66
#define RD4                           67
#define RD5                           68
#define RD6                           69
#define RD7                           70
#define RE0                           71
#define PORTE                         72
#define RE1                           73
#define RE2                           74
#define RE3                           75
#define PIR1                          76
#define TMR1IF                        77
#define TMR2IF                        78
#define CCP1IF                        79
#define SSP1IF                        80
#define TXIF                          81
#define RCIF                          82
#define ADIF                          83
#define TMR1GIF                       84
#define PIR2                          85
#define CCP2IF                        86
#define C3IF                          87
#define C4IF                          88
#define BCL1IF                        89
#define EEIF                          90
#define C1IF                          91
#define C2IF                          92
#define OSFIF                         93
#define PIR3                          94
#define CCP3IF                        95
#define PIR4                          96
#define PSMC1SIF                      97
#define PSMC2SIF                      98
#define PSMC3SIF                      99
#define PSMC1TIF                      100
#define PSMC2TIF                      101
#define PSMC3TIF                      102
#define TMR0                          103
#define TMR1L                         104
#define TMR1H                         105
#define T1CON                         106
#define TMR1ON                        107
#define nT1SYNC                       108
#define T1OSCEN                       109
#define T1CKPS0                       110
#define T1CKPS                        111
#define T1CKPS1                       112
#define TMR1CS                        113
#define TMR1CS0                       114
#define TMR1CS1                       115
#define T1GCON                        116
#define T1GSS0                        117
#define T1GSS                         118
#define T1GSS1                        119
#define T1GVAL                        120
#define T1GGO                         121
#define T1GSPM                        122
#define T1GTM                         123
#define T1GPOL                        124
#define TMR1GE                        125
#define TMR2                          126
#define PR2                           127
#define T2CON                         128
#define T2CKPS0                       129
#define T2CKPS                        130
#define T2CKPS1                       131
#define TMR2ON                        132
#define T2OUTPS0                      133
#define T2OUTPS                       134
#define T2OUTPS1                      135
#define T2OUTPS2                      136
#define T2OUTPS3                      137
#define TRISA                         138
#define TRISA0                        139
#define TRISA1                        140
#define TRISA2                        141
#define TRISA3                        142
#define TRISA4                        143
#define TRISA5                        144
#define TRISA6                        145
#define TRISA7                        146
#define TRISB                         147
#define TRISB0                        148
#define TRISB1                        149
#define TRISB2                        150
#define TRISB3                        151
#define TRISB4                        152
#define TRISB5                        153
#define TRISB6                        154
#define TRISB7                        155
#define TRISC                         156
#define TRISC0                        157
#define TRISC1                        158
#define TRISC2                        159
#define TRISC3                        160
#define TRISC4                        161
#define TRISC5                        162
#define TRISC6                        163
#define TRISC7                        164
#define TRISD0                        165
#define TRISD                         166
#define TRISD1                        167
#define TRISD2                        168
#define TRISD3                        169
#define TRISD4                        170
#define TRISD5                        171
#define TRISD6                        172
#define TRISD7                        173
#define TRISE                         174
#define TRISE0                        175
#define TRISE1                        176
#define TRISE2                        177
#define TRISE3                        178
#define PIE1                          179
#define TMR1IE                        180
#define TMR2IE                        181
#define CCP1IE                        182
#define SSP1IE                        183
#define TXIE                          184
#define RCIE                          185
#define ADIE                          186
#define TMR1GIE                       187
#define PIE2                          188
#define CCP2IE                        189
#define C3IE                          190
#define C4IE                          191
#define BCL1IE                        192
#define EEIE                          193
#define C1IE                          194
#define C2IE                          195
#define OSFIE                         196
#define PIE3                          197
#define CCP3IE                        198
#define PIE4                          199
#define PSMC1SIE                      200
#define PSMC2SIE                      201
#define PSMC3SIE                      202
#define PSMC1TIE                      203
#define PSMC2TIE                      204
#define PMSC3TIE                      205
#define PSMC3TIE                      206
#define OPTION_REG                    207
#define PS                            208
#define PS0                           209
#define PS1                           210
#define PS2                           211
#define PSA                           212
#define T0SE                          213
#define TMR0SE                        214
#define T0CS                          215
#define TMR0CS                        216
#define INTEDG                        217
#define nWPUEN                        218
#define PCON                          219
#define nBOR                          220
#define nPOR                          221
#define nRI                           222
#define nRMCLR                        223
#define nRWDT                         224
#define STKUNF                        225
#define STKOVF                        226
#define WDTCON                        227
#define SWDTEN                        228
#define WDTPS                         229
#define WDTPS0                        230
#define WDTPS1                        231
#define WDTPS2                        232
#define WDTPS3                        233
#define WDTPS4                        234
#define OSCTUNE                       235
#define TUN0                          236
#define TUN                           237
#define TUN1                          238
#define TUN2                          239
#define TUN3                          240
#define TUN4                          241
#define TUN5                          242
#define OSCCON                        243
#define SCS0                          244
#define SCS                           245
#define SCS1                          246
#define IRCF                          247
#define IRCF0                         248
#define IRCF1                         249
#define IRCF2                         250
#define IRCF3                         251
#define SPLLEN                        252
#define OSCSTAT                       253
#define HFIOFS                        254
#define LFIOFR                        255
#define MFIOFR                        256
#define HFIOFL                        257
#define HFIOFR                        258
#define OSTS                          259
#define PLLR                          260
#define T1OSCR                        261
#define ADRESL                        262
#define ADRESH                        263
#define ADCON0                        264
#define ADON                          265
#define GO_nDONE                      266
#define DONE                          267
#define GO                            268
#define ADGO                          269
#define CHS0                          270
#define CHS                           271
#define CHS1                          272
#define CHS2                          273
#define CHS3                          274
#define CHS4                          275
#define ADRMD                         276
#define ADCON1                        277
#define ADPREF0                       278
#define ADPREF                        279
#define ADPREF1                       280
#define ADNREF                        281
#define ADCS0                         282
#define ADCS                          283
#define ADCS1                         284
#define ADCS2                         285
#define ADFM                          286
#define ADCON2                        287
#define CHSN0                         288
#define CHSN                          289
#define CHSN1                         290
#define CHSN2                         291
#define CHSN3                         292
#define TRIGSEL                       293
#define TRIGSEL0                      294
#define TRIGSEL1                      295
#define TRIGSEL2                      296
#define TRIGSEL3                      297
#define LATA0                         298
#define LATA                          299
#define LATA1                         300
#define LATA2                         301
#define LATA3                         302
#define LATA4                         303
#define LATA5                         304
#define LATA6                         305
#define LATA7                         306
#define LATB0                         307
#define LATB                          308
#define LATB1                         309
#define LATB2                         310
#define LATB3                         311
#define LATB4                         312
#define LATB5                         313
#define LATB6                         314
#define LATB7                         315
#define LATC0                         316
#define LATC                          317
#define LATC1                         318
#define LATC2                         319
#define LATC3                         320
#define LATC4                         321
#define LATC5                         322
#define LATC6                         323
#define LATC7                         324
#define LATD0                         325
#define LATD                          326
#define LATD1                         327
#define LATD2                         328
#define LATD3                         329
#define LATD4                         330
#define LATD5                         331
#define LATD6                         332
#define LATD7                         333
#define LATE0                         334
#define LATE                          335
#define LATE1                         336
#define LATE2                         337
#define CM1CON0                       338
#define C1SYNC                        339
#define C1HYS                         340
#define C1SP                          341
#define C1ZLF                         342
#define C1POL                         343
#define C1OE                          344
#define C1OUT                         345
#define C1ON                          346
#define CM1CON1                       347
#define C1NCH0                        348
#define C1NCH                         349
#define C1NCH1                        350
#define C1NCH2                        351
#define C1PCH                         352
#define C1PCH0                        353
#define C1PCH1                        354
#define C1PCH2                        355
#define C1INTN                        356
#define C1INTP                        357
#define CM2CON0                       358
#define C2SYNC                        359
#define C2HYS                         360
#define C2SP                          361
#define C2ZLF                         362
#define C2POL                         363
#define C2OE                          364
#define C2OUT                         365
#define C2ON                          366
#define CM2CON1                       367
#define C2NCH0                        368
#define C2NCH                         369
#define C2NCH1                        370
#define C2NCH2                        371
#define C2PCH                         372
#define C2PCH0                        373
#define C2PCH1                        374
#define C2PCH2                        375
#define C2INTN                        376
#define C2INTP                        377
#define CMOUT                         378
#define MC1OUT                        379
#define MC2OUT                        380
#define MC3OUT                        381
#define MC4OUT                        382
#define BORCON                        383
#define BORRDY                        384
#define BORFS                         385
#define SBOREN                        386
#define FVRCON                        387
#define ADFVR0                        388
#define ADFVR                         389
#define ADFVR1                        390
#define CDAFVR0                       391
#define CDAFVR                        392
#define CDAFVR1                       393
#define TSRNG                         394
#define TSEN                          395
#define FVRRDY                        396
#define FVREN                         397
#define DACCON0                       398
#define DACNSS                        399
#define DACPSS                        400
#define DACPSS0                       401
#define DACPSS1                       402
#define DACOE2                        403
#define DACOE1                        404
#define DACEN                         405
#define DACCON1                       406
#define DACR0                         407
#define DACR                          408
#define DACR1                         409
#define DACR2                         410
#define DACR3                         411
#define DACR4                         412
#define DACR5                         413
#define DACR6                         414
#define DACR7                         415
#define CM4CON0                       416
#define C4SYNC                        417
#define C4HYS                         418
#define C4SP                          419
#define C4ZLF                         420
#define C4POL                         421
#define C4OE                          422
#define C4OUT                         423
#define C4ON                          424
#define CM4CON1                       425
#define C4NCH0                        426
#define C4NCH                         427
#define C4NCH1                        428
#define C4NCH2                        429
#define C4PCH0                        430
#define C4PCH                         431
#define C4PCH1                        432
#define C4PCH2                        433
#define C4INTN                        434
#define C4INTP                        435
#define APFCON2                       436
#define CCP3SEL                       437
#define APFCON1                       438
#define CCP2SEL                       439
#define RXSEL                         440
#define TXSEL                         441
#define SDISEL                        442
#define SCKSEL                        443
#define SDOSEL                        444
#define CCP1SEL                       445
#define C2OUTSEL                      446
#define CM3CON0                       447
#define C3SYNC                        448
#define C3HYS                         449
#define C3SP                          450
#define C3ZLF                         451
#define C3POL                         452
#define C3OE                          453
#define C3OUT                         454
#define C3ON                          455
#define CM3CON1                       456
#define C3NCH                         457
#define C3NCH0                        458
#define C3NCH1                        459
#define C3NCH2                        460
#define C3PCH                         461
#define C3PCH0                        462
#define C3PCH1                        463
#define C3PCH2                        464
#define C3INTN                        465
#define C3INTP                        466
#define ANSA0                         467
#define ANSELA                        468
#define ANSA1                         469
#define ANSA2                         470
#define ANSA3                         471
#define ANSA4                         472
#define ANSA5                         473
#define ANSA7                         474
#define ANSB0                         475
#define ANSELB                        476
#define ANSB1                         477
#define ANSB2                         478
#define ANSB3                         479
#define ANSB4                         480
#define ANSB5                         481
#define ANSB6                         482
#define ANSELD                        483
#define ANSD                          484
#define ANSD0                         485
#define ANSD1                         486
#define ANSD2                         487
#define ANSELE                        488
#define ANSE                          489
#define ANSE0                         490
#define ANSE1                         491
#define ANSE2                         492
#define EEADRL                        493
#define EEADRH                        494
#define EEDATL                        495
#define EEDATH                        496
#define EECON1                        497
#define RD                            498
#define WR                            499
#define WREN                          500
#define WRERR                         501
#define FREE                          502
#define LWLO                          503
#define CFGS                          504
#define EEPGD                         505
#define EECON2                        506
#define VREGCON                       507
#define VREGPM                        508
#define RC1REG                        509
#define TX1REG                        510
#define SP1BRGL                       511
#define SP1BRGH                       512
#define RC1STA                        513
#define RX9D                          514
#define OERR                          515
#define FERR                          516
#define ADDEN                         517
#define CREN                          518
#define SREN                          519
#define RX9                           520
#define SPEN                          521
