tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1787_tdd.h
#define TX1STA                        522
#define TX9D                          523
#define TRMT                          524
#define BRGH                          525
#define SENDB                         526
#define SYNC                          527
#define TXEN                          528
#define TX9                           529
#define CSRC                          530
#define BAUD1CON                      531
#define ABDEN                         532
#define WUE                           533
#define BRG16                         534
#define SCKP                          535
#define RCIDL                         536
#define ABDOVF                        537
#define WPUA0                         538
#define WPUA                          539
#define WPUA1                         540
#define WPUA2                         541
#define WPUA3                         542
#define WPUA4                         543
#define WPUA5                         544
#define WPUA6                         545
#define WPUA7                         546
#define WPUB0                         547
#define WPUB                          548
#define WPUB1                         549
#define WPUB2                         550
#define WPUB3                         551
#define WPUB4                         552
#define WPUB5                         553
#define WPUB6                         554
#define WPUB7                         555
#define WPUC0                         556
#define WPUC                          557
#define WPUC1                         558
#define WPUC2                         559
#define WPUC3                         560
#define WPUC4                         561
#define WPUC5                         562
#define WPUC6                         563
#define WPUC7                         564
#define WPUD                          565
#define WPUD0                         566
#define WPUD1                         567
#define WPUD2                         568
#define WPUD3                         569
#define WPUD4                         570
#define WPUD5                         571
#define WPUD6                         572
#define WPUD7                         573
#define WPUE                          574
#define WPUE0                         575
#define WPUE1                         576
#define WPUE2                         577
#define WPUE3                         578
#define SSP1BUF                       579
#define BUF                           580
#define BUF0                          581
#define SSP1BUF0                      582
#define BUF1                          583
#define SSP1BUF1                      584
#define BUF2                          585
#define SSP1BUF2                      586
#define BUF3                          587
#define SSP1BUF3                      588
#define BUF4                          589
#define SSP1BUF4                      590
#define BUF5                          591
#define SSP1BUF5                      592
#define BUF6                          593
#define SSP1BUF6                      594
#define BUF7                          595
#define SSP1BUF7                      596
#define ADD0                          597
#define ADD                           598
#define SSP1ADD0                      599
#define SSP1ADD                       600
#define ADD1                          601
#define SSP1ADD1                      602
#define ADD2                          603
#define SSP1ADD2                      604
#define ADD3                          605
#define SSP1ADD3                      606
#define ADD4                          607
#define SSP1ADD4                      608
#define ADD5                          609
#define SSP1ADD5                      610
#define ADD6                          611
#define SSP1ADD6                      612
#define ADD7                          613
#define SSP1ADD7                      614
#define SSP1MSK0                      615
#define SSP1MSK                       616
#define MSK0                          617
#define MSK                           618
#define SSP1MSK1                      619
#define MSK1                          620
#define SSP1MSK2                      621
#define MSK2                          622
#define SSP1MSK3                      623
#define MSK3                          624
#define SSP1MSK4                      625
#define MSK4                          626
#define SSP1MSK5                      627
#define MSK5                          628
#define SSP1MSK6                      629
#define MSK6                          630
#define SSP1MSK7                      631
#define MSK7                          632
#define SSP1STAT                      633
#define BF                            634
#define UA                            635
#define R_nW                          636
#define S                             637
#define P                             638
#define D_nA                          639
#define CKE                           640
#define SMP                           641
#define SSP1CON1                      642
#define SSPM0                         643
#define SSPM                          644
#define SSPM1                         645
#define SSPM2                         646
#define SSPM3                         647
#define CKP                           648
#define SSPEN                         649
#define SSPOV                         650
#define WCOL                          651
#define SSP1CON2                      652
#define SEN                           653
#define RSEN                          654
#define PEN                           655
#define RCEN                          656
#define ACKEN                         657
#define ACKDT                         658
#define ACKSTAT                       659
#define GCEN                          660
#define SSP1CON3                      661
#define DHEN                          662
#define AHEN                          663
#define SBCDE                         664
#define SDAHT                         665
#define BOEN                          666
#define SCIE                          667
#define PCIE                          668
#define ACKTIM                        669
#define ODCONA0                       670
#define ODCONA                        671
#define ODCONA1                       672
#define ODCONA2                       673
#define ODCONA3                       674
#define ODCONA4                       675
#define ODCONA5                       676
#define ODCONA6                       677
#define ODCONA7                       678
#define ODCONB0                       679
#define ODCONB                        680
#define ODCONB1                       681
#define ODCONB2                       682
#define ODCONB3                       683
#define ODCONB4                       684
#define ODCONB5                       685
#define ODCONB6                       686
#define ODCONB7                       687
#define ODCONC0                       688
#define ODCONC                        689
#define ODCONC1                       690
#define ODCONC2                       691
#define ODCONC3                       692
#define ODCONC4                       693
#define ODCONC5                       694
#define ODCONC6                       695
#define ODCONC7                       696
#define ODCOND0                       697
#define ODCOND                        698
#define ODCOND1                       699
#define ODCOND2                       700
#define ODCOND3                       701
#define ODCOND4                       702
#define ODCOND5                       703
#define ODCOND6                       704
#define ODCOND7                       705
#define ODCONE0                       706
#define ODCONE                        707
#define ODCONE1                       708
#define ODCONE2                       709
#define CCPR1L                        710
#define CCPR1H                        711
#define CCP1CON                       712
#define CCP1M0                        713
#define CCP1M                         714
#define CCP1M1                        715
#define CCP1M2                        716
#define CCP1M3                        717
#define DC1B                          718
#define DC1B0                         719
#define DC1B1                         720
#define CCPR2L                        721
#define CCPR2H                        722
#define CCP2CON                       723
#define CCP2M                         724
#define CCP2M0                        725
#define CCP2M1                        726
#define CCP2M2                        727
#define CCP2M3                        728
#define DC2B0                         729
#define DC2B                          730
#define DC2B1                         731
#define SLRCONA0                      732
#define SLRCONA                       733
#define SLRCONA1                      734
#define SLRCONA2                      735
#define SLRCONA3                      736
#define SLRCONA4                      737
#define SLRCONA5                      738
#define SLRCONA6                      739
#define SLRCONA7                      740
#define SLRCONB                       741
#define SLRCONB0                      742
#define SLRCONB1                      743
#define SLRCONB2                      744
#define SLRCONB3                      745
#define SLRCONB4                      746
#define SLRCONB5                      747
#define SLRCONB6                      748
#define SLRCONB7                      749
#define SLRCONC                       750
#define SLRCONC0                      751
#define SLRCONC1                      752
#define SLRCONC2                      753
#define SLRCONC3                      754
#define SLRCONC4                      755
#define SLRCONC5                      756
#define SLRCONC6                      757
#define SLRCONC7                      758
#define SLRCOND0                      759
#define SLRCOND                       760
#define SLRCOND1                      761
#define SLRCOND2                      762
#define SLRCOND3                      763
#define SLRCOND4                      764
#define SLRCOND5                      765
#define SLRCOND6                      766
#define SLRCOND7                      767
#define SLRCONE0                      768
#define SLRCONE                       769
#define SLRCONE1                      770
#define SLRCONE2                      771
#define CCPR3L                        772
#define CCPR3H                        773
#define CCP3CON                       774
#define CCP3M                         775
#define CCP3M0                        776
#define CCP3M1                        777
#define CCP3M2                        778
#define CCP3M3                        779
#define DC3B                          780
#define DC3B0                         781
#define DC3B1                         782
#define INLVLA                        783
#define INLVLA0                       784
#define INLVLA1                       785
#define INLVLA2                       786
#define INLVLA3                       787
#define INLVLA4                       788
#define INLVLA5                       789
#define INLVLA6                       790
#define INLVLA7                       791
#define INLVLB                        792
#define INLVLB0                       793
#define INLVLB1                       794
#define INLVLB2                       795
#define INLVLB3                       796
#define INLVLB4                       797
#define INLVLB5                       798
#define INLVLB6                       799
#define INLVLB7                       800
#define INLVLC                        801
#define INLVLC0                       802
#define INLVLC1                       803
#define INLVLC2                       804
#define INLVLC3                       805
#define INLVLC4                       806
#define INLVLC5                       807
#define INLVLC6                       808
#define INLVLC7                       809
#define INLVLD0                       810
#define INLVLD                        811
#define INLVLD1                       812
#define INLVLD2                       813
#define INLVLD3                       814
#define INLVLD4                       815
#define INLVLD5                       816
#define INLVLD6                       817
#define INLVLD7                       818
#define INLVLE                        819
#define INLVLE0                       820
#define INLVLE1                       821
#define INLVLE2                       822
#define INLVLE3                       823
#define IOCAP                         824
#define IOCAP0                        825
#define IOCAP1                        826
#define IOCAP2                        827
#define IOCAP3                        828
#define IOCAP4                        829
#define IOCAP5                        830
#define IOCAP6                        831
#define IOCAP7                        832
#define IOCAN                         833
#define IOCAN0                        834
#define IOCAN1                        835
#define IOCAN2                        836
#define IOCAN3                        837
#define IOCAN4                        838
#define IOCAN5                        839
#define IOCAN6                        840
#define IOCAN7                        841
#define IOCAF0                        842
#define IOCAF                         843
#define IOCAF1                        844
#define IOCAF2                        845
#define IOCAF3                        846
#define IOCAF4                        847
#define IOCAF5                        848
#define IOCAF6                        849
#define IOCAF7                        850
#define IOCBP                         851
#define IOCBP0                        852
#define IOCBP1                        853
#define IOCBP2                        854
#define IOCBP3                        855
#define IOCBP4                        856
#define IOCBP5                        857
#define IOCBP6                        858
#define IOCBP7                        859
#define IOCBN0                        860
#define IOCBN                         861
#define IOCBN1                        862
#define IOCBN2                        863
#define IOCBN3                        864
#define IOCBN4                        865
#define IOCBN5                        866
#define IOCBN6                        867
#define IOCBN7                        868
#define IOCBF0                        869
#define IOCBF                         870
#define IOCBF1                        871
#define IOCBF2                        872
#define IOCBF3                        873
#define IOCBF4                        874
#define IOCBF5                        875
#define IOCBF6                        876
#define IOCBF7                        877
#define IOCCP0                        878
#define IOCCP                         879
#define IOCCP1                        880
#define IOCCP2                        881
#define IOCCP3                        882
#define IOCCP4                        883
#define IOCCP5                        884
#define IOCCP6                        885
#define IOCCP7                        886
#define IOCCN0                        887
#define IOCCN                         888
#define IOCCN1                        889
#define IOCCN2                        890
#define IOCCN3                        891
#define IOCCN4                        892
#define IOCCN5                        893
#define IOCCN6                        894
#define IOCCN7                        895
#define IOCCF0                        896
#define IOCCF                         897
#define IOCCF1                        898
#define IOCCF2                        899
#define IOCCF3                        900
#define IOCCF4                        901
#define IOCCF5                        902
#define IOCCF6                        903
#define IOCCF7                        904
#define IOCEP                         905
#define IOCEP3                        906
#define IOCEN                         907
#define IOCEN3                        908
#define IOCEF                         909
#define IOCEF3                        910
#define OPA1CON                       911
#define OPA1CON_PCH                   912
#define OPA1PCH                       913
#define OPA1CON_PCH0                  914
#define OPA1PCH0                      915
#define OPA1CON_PCH1                  916
#define OPA1PCH1                      917
#define OPA1CON_SP                    918
#define OPA1SP                        919
#define OPA1CON_EN                    920
#define OPA1EN                        921
#define OPA2CON                       922
#define OPA2CON_PCH                   923
#define OPA2CON_PCH0                  924
#define OPA2PCH                       925
#define OPA2PCH0                      926
#define OPA2CON_PCH1                  927
#define OPA2PCH1                      928
#define OPA2CON_SP                    929
#define OPA2SP                        930
#define OPA2EN                        931
#define OPA2CON_EN                    932
#define OPA3CON                       933
#define OPA3CON_PCH0                  934
#define OPA3CON_PCH                   935
#define OPA3PCH                       936
#define OPA3PCH0                      937
#define OPA3CON_PCH1                  938
#define OPA3PCH1                      939
#define OPA3SP                        940
#define OPA3CON_SP                    941
#define OPA3CON_EN                    942
#define OPA3EN                        943
#define CLKRCON                       944
#define CLKRDIV                       945
#define CLKRDIV0                      946
#define CLKRDIV1                      947
#define CLKRDIV2                      948
#define CLKRDC                        949
#define CLKRDC0                       950
#define CLKRDC1                       951
#define CLKRSLR                       952
#define CLKROE                        953
#define CLKREN                        954
#define PSMC1CON                      955
#define P1MODE                        956
#define P1MODE0                       957
#define P1MODE1                       958
#define P1MODE2                       959
#define P1MODE3                       960
#define P1DBRE                        961
#define P1DBFE                        962
#define PSMC1LD                       963
#define PSMC1EN                       964
#define PSMC1MDL                      965
#define P1MSRC0                       966
#define P1MSRC                        967
#define P1MSRC1                       968
#define P1MSRC2                       969
#define P1MSRC3                       970
#define P1MDLBIT                      971
#define P1MDLPOL                      972
#define P1MDLEN                       973
#define PSMC1SYNC                     974
#define P1SYNC0                       975
#define P1SYNC1                       976
#define P1SYNC2                       977
#define P1DCPOL                       978
#define P1PRPOL                       979
#define P1POFST                       980
#define PSMC1CLK                      981
#define P1CSRC                        982
#define P1CSRC0                       983
#define P1CSRC1                       984
#define P1CPRE                        985
#define P1CPRE0                       986
#define P1CPRE1                       987
#define PSMC1OEN                      988
#define P1OEA                         989
#define P1OEB                         990
#define P1OEC                         991
#define P1OED                         992
#define P1OEE                         993
#define P1OEF                         994
#define PSMC1POL                      995
#define P1POLA                        996
#define P1POLB                        997
#define P1POLC                        998
#define P1POLD                        999
#define P1POLE                        1000
#define P1POLF                        1001
#define P1INPOL                       1002
#define PSMC1BLNK                     1003
#define P1REBM                        1004
#define P1REBM0                       1005
#define P1REBM1                       1006
#define P1FEBM0                       1007
#define P1FEBM                        1008
#define P1FEBM1                       1009
#define PSMC1REBS                     1010
#define P1REBSC1                      1011
#define P1REBSC2                      1012
#define P1REBSC3                      1013
#define P1REBSC4                      1014
#define P1REBSIN                      1015
#define PSMC1FEBS                     1016
#define P1FEBSC1                      1017
#define P1FEBSC2                      1018
#define P1FEBSC3                      1019
#define P1FEBSC4                      1020
#define P1FEBSIN                      1021
#define PSMC1PHS                      1022
#define P1PHST                        1023
#define P1PHSC1                       1024
#define P1PHSC2                       1025
#define P1PHSC3                       1026
#define P1PHSC4                       1027
#define P1PHSIN                       1028
#define PSMC1DCS                      1029
#define P1DCST                        1030
#define P1DCSC1                       1031
#define P1DCSC2                       1032
#define P1DCSC3                       1033
#define P1DCSC4                       1034
#define P1DCSIN                       1035
#define PSMC1PRS                      1036
#define P1PRST                        1037
#define P1PRSC1                       1038
#define P1PRSC2                       1039
#define P1PRSC3                       1040
#define P1PRSC4                       1041
#define P1PRSIN                       1042
#define PSMC1ASDC                     1043
#define P1ASDOV                       1044
#define P1ARSEN                       1045
#define P1ASDEN                       1046
#define P1ASE                         1047
#define PSMC1ASDL                     1048
#define P1ASDLA                       1049
#define P1ASDLB                       1050
#define P1ASDLC                       1051
#define P1ASDLD                       1052
#define P1ASDLE                       1053
#define P1ASDLF                       1054
#define PSMC1ASDS                     1055
#define P1ASDSC1                      1056
#define P1ASDSC2                      1057
#define P1ASDSC3                      1058
#define P1ASDSC4                      1059
#define P1ASDSIN                      1060
#define PSMC1INT                      1061
#define P1TPRIF                       1062
#define P1TDCIF                       1063
#define P1TPHIF                       1064
#define P1TOVIF                       1065
#define P1TPRIE                       1066
#define P1TDCIE                       1067
#define P1TPHIE                       1068
#define P1TOVIE                       1069
#define PSMC1PHL                      1070
#define PSMC1PH0                      1071
#define PSMC1PH1                      1072
#define PSMC1PH2                      1073
#define PSMC1PH3                      1074
#define PSMC1PH4                      1075
#define PSMC1PH5                      1076
#define PSMC1PH6                      1077
#define PSMC1PH7                      1078
#define PSMC1PHH                      1079
#define PSMC1PH8                      1080
#define PSMC1PH9                      1081
#define PSMC1PH10                     1082
#define PSMC1PH11                     1083
#define PSMC1PH12                     1084
#define PSMC1PH13                     1085
#define PSMC1PH14                     1086
#define PSMC1PH15                     1087
#define PSMC1DCL                      1088
#define PSMC1DC0                      1089
#define PSMC1DC1                      1090
