tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1787_tdd.h
#define PSMC1DC2                      1091
#define PSMC1DC3                      1092
#define PSMC1DC4                      1093
#define PSMC1DC5                      1094
#define PSMC1DC6                      1095
#define PSMC1DC7                      1096
#define PSMC1DCH                      1097
#define PSMC1DC8                      1098
#define PSMC1DC9                      1099
#define PSMC1DC10                     1100
#define PSMC1DC11                     1101
#define PSMC1DC12                     1102
#define PSMC1DC13                     1103
#define PSMC1DC14                     1104
#define PSMC1DC15                     1105
#define PSMC1PRL                      1106
#define PSMC1PR0                      1107
#define PSMC1PR1                      1108
#define PSMC1PR2                      1109
#define PSMC1PR3                      1110
#define PSMC1PR4                      1111
#define PSMC1PR5                      1112
#define PSMC1PR6                      1113
#define PSMC1PR7                      1114
#define PSMC1PRH                      1115
#define PSMC1PR8                      1116
#define PSMC1PR9                      1117
#define PSMC1PR10                     1118
#define PSMC1PR11                     1119
#define PSMC1PR12                     1120
#define PSMC1PR13                     1121
#define PSMC1PR14                     1122
#define PSMC1PR15                     1123
#define PSMC1TMRL                     1124
#define PSMC1TMR0                     1125
#define PSMC1TMR1                     1126
#define PSMC1TMR2                     1127
#define PSMC1TMR3                     1128
#define PSMC1TMR4                     1129
#define PSMC1TMR5                     1130
#define PSMC1TMR6                     1131
#define PSMC1TMR7                     1132
#define PSMC1TMRH                     1133
#define PSMC1TMR8                     1134
#define PSMC1TMR9                     1135
#define PSMC1TMR10                    1136
#define PSMC1TMR11                    1137
#define PSMC1TMR12                    1138
#define PSMC1TMR13                    1139
#define PSMC1TMR14                    1140
#define PSMC1TMR15                    1141
#define PSMC1DBR                      1142
#define PSMC1DBR0                     1143
#define PSMC1DBR1                     1144
#define PSMC1DBR2                     1145
#define PSMC1DBR3                     1146
#define PSMC1DBR4                     1147
#define PSMC1DBR5                     1148
#define PSMC1DBR6                     1149
#define PSMC1DBR7                     1150
#define PSMC1DBF                      1151
#define PSMC1DBF0                     1152
#define PSMC1DBF1                     1153
#define PSMC1DBF2                     1154
#define PSMC1DBF3                     1155
#define PSMC1DBF4                     1156
#define PSMC1DBF5                     1157
#define PSMC1DBF6                     1158
#define PSMC1DBF7                     1159
#define PSMC1BLKR                     1160
#define PSMC1BLKR0                    1161
#define PSMC1BLKR1                    1162
#define PSMC1BLKR2                    1163
#define PSMC1BLKR3                    1164
#define PSMC1BLKR4                    1165
#define PSMC1BLKR5                    1166
#define PSMC1BLKR6                    1167
#define PSMC1BLKR7                    1168
#define PSMC1BLKF                     1169
#define PSMC1BLKF0                    1170
#define PSMC1BLKF1                    1171
#define PSMC1BLKF2                    1172
#define PSMC1BLKF3                    1173
#define PSMC1BLKF4                    1174
#define PSMC1BLKF5                    1175
#define PSMC1BLKF6                    1176
#define PSMC1BLKF7                    1177
#define PSMC1FFA                      1178
#define PSMC1FFA0                     1179
#define PSMC1FFA1                     1180
#define PSMC1FFA2                     1181
#define PSMC1FFA3                     1182
#define PSMC1STR0                     1183
#define P1STRA                        1184
#define P1STRB                        1185
#define P1STRC                        1186
#define P1STRD                        1187
#define P1STRE                        1188
#define P1STRF                        1189
#define PSMC1STR1                     1190
#define P1HSMEN                       1191
#define P1LSMEN                       1192
#define P1SSYNC                       1193
#define PSMC2CON                      1194
#define P2MODE                        1195
#define P2MODE0                       1196
#define P2MODE1                       1197
#define P2MODE2                       1198
#define P2MODE3                       1199
#define P2DBRE                        1200
#define P2DBFE                        1201
#define PSMC2LD                       1202
#define PSMC2EN                       1203
#define PSMC2MDL                      1204
#define P2MSRC                        1205
#define P2MSRC0                       1206
#define P2MSRC1                       1207
#define P2MSRC2                       1208
#define P2MSRC3                       1209
#define P2MDLBIT                      1210
#define P2MDLPOL                      1211
#define P2MDLEN                       1212
#define PSMC2SYNC                     1213
#define P2SYNC0                       1214
#define P2SYNC1                       1215
#define P2SYNC2                       1216
#define P2DCPOL                       1217
#define P2PRPOL                       1218
#define P2POFST                       1219
#define PSMC2CLK                      1220
#define P2CSRC0                       1221
#define P2CSRC                        1222
#define P2CSRC1                       1223
#define P2CPRE                        1224
#define P2CPRE0                       1225
#define P2CPRE1                       1226
#define PSMC2OEN                      1227
#define P2OEA                         1228
#define P2OEB                         1229
#define PSMC2POL                      1230
#define P2POLA                        1231
#define P2POLB                        1232
#define P2INPOL                       1233
#define PSMC2BLNK                     1234
#define P2REBM                        1235
#define P2REBM0                       1236
#define P2REBM1                       1237
#define P2FEBM0                       1238
#define P2FEBM                        1239
#define P2FEBM1                       1240
#define PSMC2REBS                     1241
#define P2REBSC1                      1242
#define P2REBSC2                      1243
#define P2REBSC3                      1244
#define P2REBSC4                      1245
#define P2REBSIN                      1246
#define PSMC2FEBS                     1247
#define P2FEBSC1                      1248
#define P2FEBSC2                      1249
#define P2FEBSC3                      1250
#define P2FEBSC4                      1251
#define P2FEBSIN                      1252
#define PSMC2PHS                      1253
#define P2PHST                        1254
#define P2PHSC1                       1255
#define P2PHSC2                       1256
#define P2PHSC3                       1257
#define P2PHSC4                       1258
#define P2PHSIN                       1259
#define PSMC2DCS                      1260
#define P2DCST                        1261
#define P2DCSC1                       1262
#define P2DCSC2                       1263
#define P2DCSC3                       1264
#define P2DCSC4                       1265
#define P2DCSIN                       1266
#define PSMC2PRS                      1267
#define P2PRST                        1268
#define P2PRSC1                       1269
#define P2PRSC2                       1270
#define P2PRSC3                       1271
#define P2PRSC4                       1272
#define P2PRSIN                       1273
#define PSMC2ASDC                     1274
#define P2ASDOV                       1275
#define P2ARSEN                       1276
#define P2ASDEN                       1277
#define P2ASE                         1278
#define PSMC2ASDL                     1279
#define P2ASDLA                       1280
#define P2ASDLB                       1281
#define PSMC2ASDS                     1282
#define P2ASDSC1                      1283
#define P2ASDSC2                      1284
#define P2ASDSC3                      1285
#define P2ASDSC4                      1286
#define P2ASDSIN                      1287
#define PSMC2INT                      1288
#define P2TPRIF                       1289
#define P2TDCIF                       1290
#define P2TPHIF                       1291
#define P2TOVIF                       1292
#define P2TPRIE                       1293
#define P2TDCIE                       1294
#define P2TPHIE                       1295
#define P2TOVIE                       1296
#define PSMC2PHL                      1297
#define PSMC2PH0                      1298
#define PSMC2PH1                      1299
#define PSMC2PH2                      1300
#define PSMC2PH3                      1301
#define PSMC2PH4                      1302
#define PSMC2PH5                      1303
#define PSMC2PH6                      1304
#define PSMC2PH7                      1305
#define PSMC2PHH                      1306
#define PSMC2PH8                      1307
#define PSMC2PH9                      1308
#define PSMC2PH10                     1309
#define PSMC2PH11                     1310
#define PSMC2PH12                     1311
#define PSMC2PH13                     1312
#define PSMC2PH14                     1313
#define PSMC2PH15                     1314
#define PSMC2DCL                      1315
#define PSMC2DC0                      1316
#define PSMC2DC1                      1317
#define PSMC2DC2                      1318
#define PSMC2DC3                      1319
#define PSMC2DC4                      1320
#define PSMC2DC5                      1321
#define PSMC2DC6                      1322
#define PSMC2DC7                      1323
#define PSMC2DCH                      1324
#define PSMC2DC8                      1325
#define PSMC2DC9                      1326
#define PSMC2DC10                     1327
#define PSMC2DC11                     1328
#define PSMC2DC12                     1329
#define PSMC2DC13                     1330
#define PSMC2DC14                     1331
#define PSMC2DC15                     1332
#define PSMC2PRL                      1333
#define PSMC2PR0                      1334
#define PSMC2PR1                      1335
#define PSMC2PR2                      1336
#define PSMC2PR3                      1337
#define PSMC2PR4                      1338
#define PSMC2PR5                      1339
#define PSMC2PR6                      1340
#define PSMC2PR7                      1341
#define PSMC2PRH                      1342
#define PSMC2PR8                      1343
#define PSMC2PR9                      1344
#define PSMC2PR10                     1345
#define PSMC2PR11                     1346
#define PSMC2PR12                     1347
#define PSMC2PR13                     1348
#define PSMC2PR14                     1349
#define PSMC2PR15                     1350
#define PSMC2TMRL                     1351
#define PSMC2TMR0                     1352
#define PSMC2TMR1                     1353
#define PSMC2TMR2                     1354
#define PSMC2TMR3                     1355
#define PSMC2TMR4                     1356
#define PSMC2TMR5                     1357
#define PSMC2TMR6                     1358
#define PSMC2TMR7                     1359
#define PSMC2TMRH                     1360
#define PSMC2TMR8                     1361
#define PSMC2TMR9                     1362
#define PSMC2TMR10                    1363
#define PSMC2TMR11                    1364
#define PSMC2TMR12                    1365
#define PSMC2TMR13                    1366
#define PSMC2TMR14                    1367
#define PSMC2TMR15                    1368
#define PSMC2DBR                      1369
#define PSMC2DBR0                     1370
#define PSMC2DBR1                     1371
#define PSMC2DBR2                     1372
#define PSMC2DBR3                     1373
#define PSMC2DBR4                     1374
#define PSMC2DBR5                     1375
#define PSMC2DBR6                     1376
#define PSMC2DBR7                     1377
#define PSMC2DBF                      1378
#define PSMC2DBF0                     1379
#define PSMC2DBF1                     1380
#define PSMC2DBF2                     1381
#define PSMC2DBF3                     1382
#define PSMC2DBF4                     1383
#define PSMC2DBF5                     1384
#define PSMC2DBF6                     1385
#define PSMC2DBF7                     1386
#define PSMC2BLKR                     1387
#define PSMC2BLKR0                    1388
#define PSMC2BLKR1                    1389
#define PSMC2BLKR2                    1390
#define PSMC2BLKR3                    1391
#define PSMC2BLKR4                    1392
#define PSMC2BLKR5                    1393
#define PSMC2BLKR6                    1394
#define PSMC2BLKR7                    1395
#define PSMC2BLKF                     1396
#define PSMC2BLKF0                    1397
#define PSMC2BLKF1                    1398
#define PSMC2BLKF2                    1399
#define PSMC2BLKF3                    1400
#define PSMC2BLKF4                    1401
#define PSMC2BLKF5                    1402
#define PSMC2BLKF6                    1403
#define PSMC2BLKF7                    1404
#define PSMC2FFA                      1405
#define PSMC2FFA0                     1406
#define PSMC2FFA1                     1407
#define PSMC2FFA2                     1408
#define PSMC2FFA3                     1409
#define PSMC2STR0                     1410
#define P2STRA                        1411
#define P2STRB                        1412
#define PSMC2STR1                     1413
#define P2HSMEN                       1414
#define P2LSMEN                       1415
#define P2SSYNC                       1416
#define PSMC3CON                      1417
#define P3MODE                        1418
#define P3MODE0                       1419
#define P3MODE1                       1420
#define P3MODE2                       1421
#define P3MODE3                       1422
#define P3DBRE                        1423
#define P3DBFE                        1424
#define PSMC3LD                       1425
#define PSMC3EN                       1426
#define PSMC3MDL                      1427
#define P3MSRC                        1428
#define P3MSRC0                       1429
#define P3MSRC1                       1430
#define P3MSRC2                       1431
#define P3MSRC3                       1432
#define P3MDLBIT                      1433
#define P3MDLPOL                      1434
#define P3MDLEN                       1435
#define PSMC3SYNC                     1436
#define P3SYNC0                       1437
#define P3SYNC1                       1438
#define P3SYNC2                       1439
#define P3DCPOL                       1440
#define P3PRPOL                       1441
#define P3POFST                       1442
#define PSMC3CLK                      1443
#define P3CSRC0                       1444
#define P3CSRC                        1445
#define P3CSRC1                       1446
#define P3CPRE                        1447
#define P3CPRE0                       1448
#define P3CPRE1                       1449
#define PSMC3OEN                      1450
#define P3OEA                         1451
#define P3OEB                         1452
#define P3OEC                         1453
#define P3OED                         1454
#define P3OEE                         1455
#define P3OEF                         1456
#define PSMC3POL                      1457
#define P3POLA                        1458
#define P3POLB                        1459
#define P3POLC                        1460
#define P3POLD                        1461
#define P3POLE                        1462
#define P3POLF                        1463
#define P3INPOL                       1464
#define PSMC3BLNK                     1465
#define P3REBM                        1466
#define P3REBM0                       1467
#define P3REBM1                       1468
#define P3FEBM                        1469
#define P3FEBM0                       1470
#define P3FEBM1                       1471
#define PSMC3REBS                     1472
#define P3REBSC1                      1473
#define P3REBSC2                      1474
#define P3REBSC3                      1475
#define P3REBSC4                      1476
#define P3REBSIN                      1477
#define PSMC3FEBS                     1478
#define P3FEBSC1                      1479
#define P3FEBSC2                      1480
#define P3FEBSC3                      1481
#define P3FEBSC4                      1482
#define P3FEBSIN                      1483
#define PSMC3PHS                      1484
#define P3PHST                        1485
#define P3PHSC1                       1486
#define P3PHSC2                       1487
#define P3PHSC3                       1488
#define P3PHSC4                       1489
#define P3PHSIN                       1490
#define PSMC3DCS                      1491
#define P3DCST                        1492
#define P3DCSC1                       1493
#define P3DCSC2                       1494
#define P3DCSC3                       1495
#define P3DCSC4                       1496
#define P3DCSIN                       1497
#define PSMC3PRS                      1498
#define P3PRST                        1499
#define P3PRSC1                       1500
#define P3PRSC2                       1501
#define P3PRSC3                       1502
#define P3PRSC4                       1503
#define P3PRSIN                       1504
#define PSMC3ASDC                     1505
#define P3ASDOV                       1506
#define P3ARSEN                       1507
#define P3ASDEN                       1508
#define P3ASE                         1509
#define PSMC3ASDL                     1510
#define P3ASDLA                       1511
#define P3ASDLB                       1512
#define P3ASDLC                       1513
#define P3ASDLD                       1514
#define P3ASDLE                       1515
#define P3ASDLF                       1516
#define PSMC3ASDS                     1517
#define P3ASDSC1                      1518
#define P3ASDSC2                      1519
#define P3ASDSC3                      1520
#define P3ASDSC4                      1521
#define P3ASDSIN                      1522
#define PSMC3INT                      1523
#define P3TPRIF                       1524
#define P3TDCIF                       1525
#define P3TPHIF                       1526
#define P3TOVIF                       1527
#define P3TPRIE                       1528
#define P3TDCIE                       1529
#define P3TPHIE                       1530
#define P3TOVIE                       1531
#define PSMC3PHL                      1532
#define PSMC3PH0                      1533
#define PSMC3PH1                      1534
#define PSMC3PH2                      1535
#define PSMC3PH3                      1536
#define PSMC3PH4                      1537
#define PSMC3PH5                      1538
#define PSMC3PH6                      1539
#define PSMC3PH7                      1540
#define PSMC3PHH                      1541
#define PSMC3PH8                      1542
#define PSMC3PH9                      1543
#define PSMC3PH10                     1544
#define PSMC3PH11                     1545
#define PSMC3PH12                     1546
#define PSMC3PH13                     1547
#define PSMC3PH14                     1548
#define PSMC3PH15                     1549
#define PSMC3DCL                      1550
#define PSMC3DC0                      1551
#define PSMC3DC1                      1552
#define PSMC3DC2                      1553
#define PSMC3DC3                      1554
#define PSMC3DC4                      1555
#define PSMC3DC5                      1556
#define PSMC3DC6                      1557
#define PSMC3DC7                      1558
#define PSMC3DCH                      1559
#define PSMC3DC8                      1560
#define PSMC3DC9                      1561
#define PSMC3DC10                     1562
#define PSMC3DC11                     1563
#define PSMC3DC12                     1564
#define PSMC3DC13                     1565
#define PSMC3DC14                     1566
#define PSMC3DC15                     1567
#define PSMC3PRL                      1568
#define PSMC3PR0                      1569
#define PSMC3PR1                      1570
#define PSMC3PR2                      1571
#define PSMC3PR3                      1572
#define PSMC3PR4                      1573
#define PSMC3PR5                      1574
#define PSMC3PR6                      1575
#define PSMC3PR7                      1576
#define PSMC3PRH                      1577
#define PSMC3PR8                      1578
#define PSMC3PR9                      1579
#define PSMC3PR10                     1580
#define PSMC3PR11                     1581
#define PSMC3PR12                     1582
#define PSMC3PR13                     1583
#define PSMC3PR14                     1584
#define PSMC3PR15                     1585
#define PSMC3TMRL                     1586
#define PSMC3TMR0                     1587
#define PSMC3TMR1                     1588
#define PSMC3TMR2                     1589
#define PSMC3TMR3                     1590
#define PSMC3TMR4                     1591
#define PSMC3TMR5                     1592
#define PSMC3TMR6                     1593
#define PSMC3TMR7                     1594
#define PSMC3TMRH                     1595
#define PSMC3TMR8                     1596
#define PSMC3TMR9                     1597
#define PSMC3TMR10                    1598
#define PSMC3TMR11                    1599
#define PSMC3TMR12                    1600
#define PSMC3TMR13                    1601
#define PSMC3TMR14                    1602
#define PSMC3TMR15                    1603
#define PSMC3DBR                      1604
#define PSMC3DBR0                     1605
#define PSMC3DBR1                     1606
#define PSMC3DBR2                     1607
#define PSMC3DBR3                     1608
#define PSMC3DBR4                     1609
#define PSMC3DBR5                     1610
#define PSMC3DBR6                     1611
#define PSMC3DBR7                     1612
#define PSMC3DBF                      1613
#define PSMC3DBF0                     1614
#define PSMC3DBF1                     1615
#define PSMC3DBF2                     1616
#define PSMC3DBF3                     1617
#define PSMC3DBF4                     1618
#define PSMC3DBF5                     1619
#define PSMC3DBF6                     1620
#define PSMC3DBF7                     1621
#define PSMC3BLKR                     1622
#define PSMC3BLKR0                    1623
#define PSMC3BLKR1                    1624
#define PSMC3BLKR2                    1625
#define PSMC3BLKR3                    1626
#define PSMC3BLKR4                    1627
#define PSMC3BLKR5                    1628
#define PSMC3BLKR6                    1629
#define PSMC3BLKR7                    1630
#define PSMC3BLKF                     1631
#define PSMC3BLKF0                    1632
#define PSMC3BLKF1                    1633
#define PSMC3BLKF2                    1634
#define PSMC3BLKF3                    1635
#define PSMC3BLKF4                    1636
#define PSMC3BLKF5                    1637
#define PSMC3BLKF6                    1638
#define PSMC3BLKF7                    1639
#define PSMC3FFA                      1640
#define PSMC3FFA0                     1641
#define PSMC3FFA1                     1642
#define PSMC3FFA2                     1643
#define PSMC3FFA3                     1644
#define PSMC3STR0                     1645
#define P3STRA                        1646
#define P3STRB                        1647
#define P3STRC                        1648
#define P3STRD                        1649
#define P3STRE                        1650
#define P3STRF                        1651
#define PSMC3STR1                     1652
#define P3HSMEN                       1653
#define P3LSMEN                       1654
#define P3SSYNC                       1655
#define STATUS_SHAD                   1656
#define C_SHAD                        1657
#define DC_SHAD                       1658
#define Z_SHAD                        1659
#define WREG_SHAD                     1660
#define BSR_SHAD                      1661
#define PCLATH_SHAD                   1662
#define FSR0L_SHAD                    1663
#define FSR0H_SHAD                    1664
#define FSR1L_SHAD                    1665
#define FSR1H_SHAD                    1666
#define STKPTR                        1667
#define TOSL                          1668
#define TOSH                          1669

#endif // _PIC16F1787_H_
